backend/app/controllers/comments_controller.rb

    def create
        # byebug
        @comment = Comment.new(comment_params)
        #if valid...bla bla
        @comment.save
---
INSERT INTO "comments" ("photo_id", "user_id", "created_at", "updated_at", "content") VALUES (?, ?, ?, ?, ?)  [["photo_id", 10], ["user_id", 10], ["created_at", "2019-06-19 10:23:12.985690"], ["updated_at", "2019-06-19 10:23:12.985690"], ["content", "hello"]]

    def update
        @comment.update(comment_params)
---
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "Hello2DeleteEdit"], ["updated_at", "2019-06-19 14:08:25.115479"], ["id", 23]]

    def find_comment
        @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]