backend/app/controllers/photos_controller.rb

INSERT INTO "photos" ("like_count", "created_at", "updated_at") VALUES (?, ?, ?)  [["like_count", 1], ["created_at", "2019-06-18 14:34:23.072167"], ["updated_at", "2019-06-18 14:34:23.072167"]]
---
    def create
        @photo = Photo.new(photo_params)
        #if valid...
        @photo.save

UPDATE "photos" SET "like_count" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["like_count", 1], ["updated_at", "2019-06-18 14:58:12.404938"], ["id", 1]]
---
    def update
        @photo.update(photo_params)

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_photo
        @photo = Photo.find(params[:id])